{
  "id": "milotic",
  "name": "Milotic",
  "image": "/placeholder.svg?height=80&width=80",
  "initialMove": "TRUCO",
  "tricks": [
    {
      "detail": "GAFAS ELEGIDAS, entra Poliwrath +6+2.",
      "variant": [
        {
          "detail": "Gardevoir hace un golpe crítico que derrota a Poliwrath, cambia a Chandelure y usa Truco para bloquear, luego entra Scrafty +3. // Si después entra Registeel, usa A Bocajarro para eliminarlo.",
          "variant": []
        }
      ]
    },
    {
      "detail": "CASCO DENTADO, entra Poliwrath +6+2. Usa A Bocajarro para eliminar a Walrein o Milotic",
      "variant": [
        {
          "detail": "Si el rival cambia a Togekiss después del Tambor, usa a Bocajarro para eliminarlo. Luego si aparece Roserade, cambia a Scrafty y observa el movimiento:",
          "variant": [
            {
              "detail": "Si usa Psíquico, Scrafty +3",
              "variant": []
            },
            {
              "detail": "Si lanza Bomba Lodo, entra Excadrill +4+2",
              "variant": []
            }
          ]
        },        
        {
          "detail": "Si entra Gyarados tras el Tambor, cambia a Chandelure y usa Truco para bloquear Cascada.",
          "variant": [
            {
              "detail": "Si Chandelure cae, cambia a Metagross, usa objeto curativo fuerte en Poliwrath, y luego entra Poliwrath +6+2",
              "variant": []
            },
            {
              "detail": "Si Chandelure sobrevive, cura a Poliwrath, cambia a Scrafty y luego a Poliwrath +6+2",
              "variant": []
            }
          ]
        }       
      ]
    },
    {
      "detail": "REGISTEEL, revisa su objeto:",
      "variant": [
        {
          "detail": "Cinta Experto: entra Excadrill +4+2",
          "variant": []
        },
        {
          "detail": "Baya Atania: entra Excadrill con Trampa Rocas puesta +2+2",
          "variant": []
        },
        {
          "detail": "Gafas Elegidas: entra Excadrill +2+2",
          "variant": []
        }
      ]
    },    
    {
      "detail": "METAGROSS, usa Chandelure con Lanzallamas para debilitarlo. Luego si entra Whiscash o Milotic, entra Poliwrath +6+2. Usa A Bocajarro para derrotar a Milotic o Walrein. // Si se congela utiliza Cura Total",
      "variant": []
    },
    {
      "detail": "Whiscash o Lanturn, entra Excadrill +4+2. // Si recibe escaldado por sorpresa, entra Poliwrath +6+2. Usa A Bocajarro para eliminar a Milotic.",
      "variant": []
    },
    {
      "detail": "Swampert, cambia a Excadrill y luego a Chandelure. Entra Gyarados, usa Truco para bloquear Cascada. Entra Poliwrath +6+2. Usa A Bocajarro para eliminar a Milotic.",
      "variant": [
        {
          "detail": "Si Chandelure fue debilitado y Poliwrath tiene 75% de salud, cambia a Scrafty y luego entra Poliwrath para potenciarse.",
          "variant": []
        }
      ]
    }
  ]
}