{
  "id": "metagross",
  "name": "Metagross",
  "image": "/placeholder.svg?height=80&width=80",
  "initialMove": "Observa si el rival tiene Globo Helio",
  "tricks": [
    {
      "detail": "SI TIENE GLOBO HELIO → Cambia a Excadrill, luego a Chandelure y usa Truco para bloquear Terremoto, Excadrill coloca Trampa Rocas +4+2",
      "variant": []
    },
    {
      "detail": "NO TIENE GLOBO HELIO → Usa Truco directamente:",
      "variant": []
    },
    {
      "detail": "TERREMOTO , cambia a Excadrill +6+2.",
      "variant": []
    },
    {
      "detail": "MACHADA, observa el objeto:",
      "variant": []
    },
    {
      "detail": "PAÑ. ELEGIDO → Cambiar a Chandelure y usar Truco, si Metagross no se retira o se queda bloqueado contra Snorlax, sacar a Scrafty +3. // Raichu lleva Banda Focus.",
      "variant": []
    },
    {
      "detail": "VIDASFERA → Cambia a Chandelure",
      "variant": [
        {
          "detail": "Nidoking/Nidoqueen → Usa Truco para bloquear Tierra Viva, luego Excadrill coloca Trampa Rocas, Cloyster +6",
          "variant": []
        },
        {
          "detail": "Bronzong → Usa Truco y ajusta según el movimiento:",
          "variant": []
        }
      ]
    },
    {
      "detail": "Terremoto → Excadrill +4+2 y coloca Trampa Rocas",
      "variant": [
        {
          "detail": "Milotic → Scrafty usa objeto de defensa y se fortalece +4 / A Bocajarro contra Metagross",
          "variant": []
        },
        {
          "detail": "METAGROSS NO SE RETIRA, usa Lanzallamas para eliminarlo y observa el cambio",
          "variant": []
        },
        {
          "detail": "MILOTIC → Cambia a Poliwrath, luego a Chandelure contra Gothitelle, usa Truco para bloquear Psicocarga, Scrafty +3",
          "variant": []
        },
        {
          "detail": "Houndoom → Cambia a Scrafty, luego a Chandelure y usa Truco para bloquear Triturar, Scrafty +4",
          "variant": []
        }
      ]
    },
    {
      "detail": "PUÑO METEORO, cambia a Chandelure y usa Lanzallamas para eliminarlo, luego ajusta según el siguiente cambio",
      "variant": [
        {
          "detail": "ALTARIA → Cambia a Metagross, coloca Trampa Rocas, luego Scrafty +2 // Empoleon, su ataque prioritario golpea a Scrafty con un 25% de daño",
          "variant": []
        },
        {
          "detail": "HOUNDOOM → Cambia a Scrafty, luego a Chandelure y usa Truco para bloquear Pulso Umbrío, luego Scrafty +2",
          "variant": []
        },
        {
          "detail": "Empoleon, cambia a Poliwrath, luego a Metagross y usa Puño Trueno para observar el cambio",
          "variant": []
        }
      ]
    },
    {
      "detail": "Serperior → Chandelure usa Lanzallamas para eliminar, observa el cambio",
      "variant": [
        {
          "detail": "Houndoom → Cambia a Scrafty, luego a Chandelure y usa Truco para bloquear Pulso Umbrío, Scrafty +2",
          "variant": []
        },
        {
          "detail": "Altaria → Cambia a Metagross, coloca Trampa Rocas, luego Scrafty +2 // Si Scrafty está debilitado a menos del 27% de HP, usa Puño Drenaje para eliminar Altaria y evitar un ataque prioritario",
          "variant": []
        }
      ]
    },
    {
      "detail": "Gallade → Cambia a Chandelure y usa Truco para bloquear Sombra Vil/Puño Hielo, luego Scrafty +3 / Paliza para Houndoom / Si enfrenta Serperior → Cambia a Chandelure y usa Lanzallamas para eliminar, luego sigue el plan de respuesta anterior 👆🏻",
      "variant": []
    },
    {
      "detail": "PUÑO HIELO, cambia a Scrafty // Metagross queda congelado, prioriza la descongelación antes de continuar.",
      "variant": [
        {
          "detail": "No se retira, usa Scrafty +3 // Si tienes +2, puedes aprovechar Puño Drenaje para recuperar HP.",
          "variant": []
        },
        {
          "detail": "Entei → Usa Chandelure y Truco para bloquear Roca Afilada, luego Scrafty +3. // Metagross sigue en combate, usa dos Puño Drenaje para eliminarlo. // tienes +1, puedes aprovechar Puño Drenaje para recuperar HP.",
          "variant": []
        }
      ]
    },
    {
      "detail": "GALLADE → Usa Chandelure y una vez Lanzallamas para observar la reacción.",
      "variant": []
    },
    {
      "detail": "GALLADE NO SE RETIRA, cambia a Scrafty contra Houndoom, luego Chandelure usa Truco para bloquear Pulso Umbrío, Scrafty +4.",
      "variant": [
        {
          "detail": "Si Gallade se quema, sigue usando Lanzallamas hasta que Houndoom entre, luego cambia a Scrafty y repite el ajuste.",
          "variant": []
        },
        {
          "detail": "Houndoom directamente → Cambia a Scrafty, luego a Chandelure y usa Truco para bloquear Pulso Umbrío, Scrafty +4 / A Bocajarro contra Metagross.",
          "variant": []
        }
      ]
    }
  ]
}